Revit 2027 API
ParameterTypeId.StructuralConnectionModifyConnectionParameters Property
 "Detailed Parameters"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionModifyConnectionParameters { get; }
Public Shared ReadOnly Property StructuralConnectionModifyConnectionParameters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionModifyConnectionParameters {
	ForgeTypeId^ get ();
}
static member StructuralConnectionModifyConnectionParameters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace